app/controllers/image_controller.rb

INSERT INTO `images` (`result`, `qid`, `created_at`, `response`, `updated_at`, `path`) VALUES(NULL, '4439aaf962799110f3d9c883406e5f978ae3e0c6', '2011-09-07 10:39:22', '{\"data\": {\"error\": 0}}', '2011-09-07 10:39:22', '/home/rajsurabhi/SANJAY PROJECTS/cropped images/IMAGES/June26_11/Jun26_11_7D1_5D1RT-018.jpg')
UPDATE `images` SET `updated_at` = '2011-09-07 11:11:06', `result` = '{\"data\": {\"comment\": \"The results for qid 1df1d9cabe71dc90c2c792c372538b7027cac8bf are not available yet\", \"error\": 0}}' WHERE `id` = 2
---
  def upload_images
    begin
      file = Image.save_image(params[:image])